tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"

cask "alacritty"
cask "brave-browser"
cask "calibre"
cask "confluent-cli"
cask "cursor"
cask "discord"
cask "expressvpn"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keeper-password-manager"
cask "logseq"
cask "raycast"
cask "rectangle"
cask "rubymine"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"

brew "aom"
brew "argocd"
brew "awscli"
brew "bat"
brew "boost"
brew "buildkit"
brew "chezmoi"
brew "clusterctl"
brew "cmake"
brew "colima"
brew "conan"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "exiftool"
brew "fd"
brew "fish"
brew "fluxcd/tap/flux"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "helix"
brew "helm"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k6"
brew "k9s"
brew "kcat"
brew "kind"
brew "kubeconform"
brew "kubectl"
brew "kustomize"
brew "lazygit"
brew "libvips"
brew "mise"
brew "mkcert"
brew "mysql-client@8.0"
brew "mysql@8.0"
brew "neovim"
brew "node@20"
brew "openssl@3"
brew "pstree"
brew "qemu"
brew "rg"
brew "ruby-install"
brew "sdl2"
brew "semgrep"
brew "shared-mime-info"
brew "starship"
brew "terraform-ls"
brew "tig"
brew "tmux"
brew "uv"
brew "watchman"
brew "ykman"
brew "zstd"
