tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "openssl@3"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "bison"
brew "boost"
brew "python@3.12"
brew "glib"
brew "chezmoi"
brew "clusterctl"
brew "cmake"
brew "conan"
brew "direnv"
brew "docutils"
brew "libevent"
brew "folly"
brew "fizz"
brew "mvfst"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "exiftool"
brew "fd"
brew "fish"
brew "fzf"
brew "gdbm"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "htop"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "k6"
brew "k9s"
brew "librdkafka"
brew "kcat"
brew "keyring"
brew "kind"
brew "kubeconform"
brew "kustomize"
brew "openjdk"
brew "leiningen"
brew "libffi"
brew "libfido2"
brew "llvm"
brew "mkcert"
brew "mysql"
brew "mysql-client@8.0"
brew "neovim"
brew "node"
brew "node@20"
brew "nushell"
brew "openssl@1.1"
brew "pstree"
brew "ripgrep"
brew "ruby-install"
brew "semgrep"
brew "starship"
brew "terraform-ls"
brew "tig"
brew "tmux"
brew "vips"
brew "watch"
brew "watchman"
brew "ykman"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
cask "1password"
cask "alacritty"
cask "amethyst"
cask "authy"
cask "brave-browser"
cask "calibre"
cask "confluent-cli"
cask "discord"
cask "docker"
cask "expressvpn"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keeper-password-manager"
cask "kindle"
cask "logseq"
cask "raycast"
cask "rectangle"
cask "rubymine"
cask "sequential"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "koichisasada.vscode-rdbg"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "solomonkinard.git-blame"
vscode "sorbet.sorbet-vscode-extension"
vscode "vscodevim.vim"
