tap "azure/kubelogin"
tap "datadog-labs/pack"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "opencode-ai/tap"

brew "aom"
brew "argocd"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "boost"
brew "buildkit"
brew "chezmoi"
brew "clusterctl"
brew "cmake"
brew "colima"
brew "composer"
brew "conan"
brew "datadog-labs/pack/pup"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "glow"
brew "go"
brew "graphviz"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "helix"
brew "helm"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jj"
brew "jq"
brew "lazyjj"
brew "k6"
brew "k9s"
brew "kargo"
brew "kcat"
brew "kind"
brew "kubeconform"
brew "kubelogin"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "llm"
brew "make"
brew "mermaid-cli"
brew "mise"
brew "mkcert"
brew "mysql"
brew "mysql-client@8.0"
brew "mysql@8.0"
brew "neovim"
brew "node@20"
brew "opencode-ai/tap/opencode"
brew "openssl@3"
brew "pdftk-java"
brew "pi-coding-agent"
brew "prettier"
brew "pstree"
brew "qemu"
brew "ripgrep"
brew "ruby-install"
brew "sdl2"
brew "semgrep"
brew "shared-mime-info"
brew "starship"
brew "terraform-ls"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "vips"
brew "watchman"
brew "ykman"
brew "yq"
brew "yt-dlp"
brew "zstd"

cask "alacritty"
cask "brave-browser"
cask "calibre"
cask "claude"
cask "claude-code"
cask "clickhouse"
cask "confluent-cli"
cask "cursor"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keeper-password-manager"
cask "libreoffice"
cask "logseq"
cask "ngrok"
cask "orion"
cask "raycast"
cask "rectangle"
cask "rubymine"
cask "slack"
cask "spotify"
cask "telegram"
cask "vlc"
cask "whatsapp"
cask "zed"

vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "cucumberopen.cucumber-official"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "factorial.vscode-factorial"
vscode "factorial.zengrep"
vscode "firsttris.vscode-jest-runner"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "karunamurti.haml"
vscode "lokalise.i18n-ally"
vscode "malo.copy-json-path"
vscode "mateuszdrewniak.ruby-test-runner"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.test-adapter-converter"
vscode "redhat.vscode-yaml"
vscode "rubocop.vscode-rubocop"
vscode "ruby-syntax-tree.vscode-syntax-tree"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "tomi.xasnippets"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
